In [4]:
import numpy as np
import pandas as pd

In [5]:
np.NaN

nan

In [6]:
np.nan

nan

In [7]:
np.NAN

nan

In [8]:
# Python is used with many languages and hence to give
# compatibility three NaN's are there in numpy

In [9]:
None

In [10]:
if 1:
    pass

In [11]:
# None has nothing, it returns nothing like void. But NaN returns and tells it has nothing

In [19]:
# pass is used to bypass the current line of execution only

In [13]:
pass

In [14]:
pass
pass
pass

In [18]:
if 1:
    pass
    print(True)
    pass

True

In [20]:
if 1:
    pass
else:
    print(True)

In [21]:
df = pd.DataFrame({'A': [1,2,np.nan],
                 'B': [5,np.nan,np.nan],
                 'C': [1,2,3]})

In [22]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [23]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [24]:
# dropna() will remove all the rows (complete rows) bydefault (axis = 0) and how is any if any one entry is NaN

In [25]:
df.dropna(how='all')

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [26]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [27]:
# above changes are not saved within it as bydefault it is Inplace = False, set it True or assign it to itself 
# to reflect or accept the changes

In [29]:
df.dropna(axis=0, subset=['A','C'])

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [30]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [32]:
# atleast 2 non-NaN should be found to accept that row. We can set the Threshold

In [33]:
df.fillna(value='exe') # fill values in place of NaN

     A    B  C
0    1    5  1
1    2  exe  2
2  exe  exe  3

In [34]:
# fillna() has many attributes like limit which tells how many NaNs to be replaced consecutively

In [37]:
df['A'].fillna(value=df['A'].mean(), inplace=True)

In [38]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [48]:
df['B'].fillna(value=df['C'].mean(), inplace=True)

In [49]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  2.0  2
2  1.5  2.0  3

In [50]:
df[['B','C']]

     B  C
0  5.0  1
1  2.0  2
2  2.0  3